src_Extension/DataProcessors/Исправитьединицуизмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>Исправитьединицуизмерения</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Спецификации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src_Extension/DataProcessors/Исправитьединицуизмерения/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбновитьИндикатор(ИндЧисло, ПоследняяДата)
	НоваяДата = ТекущаяДата();
	Если Индикатор<>ИндЧисло И ПоследняяДата<>НоваяДата тогда
		ПоследняяДата = НоваяДата;
		Индикатор=ИндЧисло;
		ОбновитьОтображениеДанных();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпецификацииНаСервере()
	РежимЧистки = Ложь;
	Объект.Спецификации.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	 	"ВЫБРАТЬ
	 	|	РесурсныеСпецификации.Ссылка КАК Спецификация,
		|	РесурсныеСпецификации.МатериалыИУслуги КАК МатериалыИУслуги,
		|	РесурсныеСпецификации.МатериалыИУслуги.Номенклатура.Ссылка КАК Номенклатура
	 	|ИЗ
	 	|	Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
	 	|ГДЕ
	 	|	РесурсныеСпецификации.Ссылка.Статус.Порядок = 1
	 	|	И (ВЫБОР
        |		КОГДА МатериалыИУслуги.Упаковка.Ссылка <> МатериалыИУслуги.Номенклатура.ЕдиницаИзмерения.Ссылка
		|		И МатериалыИУслуги.Номенклатура.ВидНоменклатуры <> &ВидВспомогательныеМатериалы
        |		ТОГДА ИСТИНА
        |		ИНАЧЕ ЛОЖЬ
        |    КОНЕЦ)";
	Запрос.УстановитьПараметр("ВидВспомогательныеМатериалы", Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Вспомогательные материалы"));
	Объект.Спецификации.Загрузить(Запрос.Выполнить().Выгрузить());              
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСпецификации(Команда)
	ЗаполнитьСпецификацииНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьСпецификациюНаСервере(Ссылка)               
	РегистрыСведений.СпецификацииИзделий.ЗаписатьИзделияПоСпецификации(Ссылка); 
	ОбработатьСпецификациюНаСервере1(Ссылка);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьСпецификациюНаСервере1(Ссылка)          
	//Спец = Справочники.РесурсныеСпецификации.ПустаяСсылка().ПолучитьОбъект();
	Спецификация = Ссылка.ПолучитьОбъект(); 
    Модифицированность = Ложь;
	Для каждого Строка из Спецификация.МатериалыИУслуги цикл  
		Номенклатура = Строка.Номенклатура;
		Упаковка = Строка.Упаковка;
		ЕдиницаХранения = Строка.Номенклатура.ЕдиницаИзмерения;
		КоличествоУпаковок = Строка.КоличествоУпаковок; 
		Если Упаковка.Код <> "    " и Упаковка <> ЕдиницаХранения тогда  
			Если Упаковка.Код = "166 " и ЕдиницаХранения.Код = "161 " тогда		//кг -> мг
				Строка.Упаковка = ЕдиницаХранения;
				Коэффициент = 1000000;
				Строка.КоличествоУпаковок = КоличествоУпаковок * Коэффициент;
				Модифицированность = Истина;
			КонецЕсли;
            Если Упаковка.Код = "161 " и ЕдиницаХранения.Код = "166 " тогда		//мг -> кг
				Строка.Упаковка = ЕдиницаХранения;
				Коэффициент = 0.000001;
				Строка.КоличествоУпаковок = КоличествоУпаковок * Коэффициент;
				Модифицированность = Истина;
			КонецЕсли;
			Если Упаковка.Код = "163 " и ЕдиницаХранения.Код = "166 " тогда		//г -> кг
				Строка.Упаковка = ЕдиницаХранения;
				Коэффициент = 0.001;
				Строка.КоличествоУпаковок = КоличествоУпаковок * Коэффициент;
				Модифицированность = Истина;
			КонецЕсли;  
			Если Упаковка.Код = "166 " и ЕдиницаХранения.Код = "163 " тогда		//кг -> г
				Строка.Упаковка = ЕдиницаХранения;
				Коэффициент = 1000;
				Строка.КоличествоУпаковок = КоличествоУпаковок * Коэффициент;
				Модифицированность = Истина;
			КонецЕсли;
			Если Упаковка.Код = "161 " и ЕдиницаХранения.Код = "163 " тогда		//мг -> г
				Строка.Упаковка = ЕдиницаХранения;
				Коэффициент = 0.001;
				Строка.КоличествоУпаковок = КоличествоУпаковок * Коэффициент;
				Модифицированность = Истина;
			КонецЕсли;
			Если Упаковка.Код = "163 " и ЕдиницаХранения.Код = "161 " тогда		//г -> мг
				Строка.Упаковка = ЕдиницаХранения;
				Коэффициент = 1000;
				Строка.КоличествоУпаковок = КоличествоУпаковок * Коэффициент;
				Модифицированность = Истина;
			КонецЕсли;
			Если Упаковка.Код = "050 " и ЕдиницаХранения.Код = "055 " тогда		//мм2 -> м2
				Строка.Упаковка = ЕдиницаХранения;
				Коэффициент = 0.000001;
				Строка.КоличествоУпаковок = КоличествоУпаковок * Коэффициент;
				Модифицированность = Истина;
			КонецЕсли;
			Если Упаковка.Код = "055 " и ЕдиницаХранения.Код = "050 " тогда		//м2 -> мм2
				Строка.Упаковка = ЕдиницаХранения;
				Коэффициент = 1000000;
				Строка.КоличествоУпаковок = КоличествоУпаковок * Коэффициент;
				Модифицированность = Истина;
			КонецЕсли;  
			Если Упаковка.Код = "004 " и ЕдиницаХранения.Код = "003 " тогда		//кг -> г
				Строка.Упаковка = ЕдиницаХранения;
				Коэффициент = 10;
				Строка.КоличествоУпаковок = КоличествоУпаковок * Коэффициент;
				Модифицированность = Истина;
			КонецЕсли;
			Если Упаковка.Код = "003 " и ЕдиницаХранения.Код = "004 " тогда		//мм -> см
				Строка.Упаковка = ЕдиницаХранения;
				Коэффициент = 0.1;
				Строка.КоличествоУпаковок = КоличествоУпаковок * Коэффициент;
				Модифицированность = Истина;
			КонецЕсли;
			Если Упаковка.Код = "006 " и ЕдиницаХранения.Код = "003 " тогда		//м -> мм
				Строка.Упаковка = ЕдиницаХранения;
				Коэффициент = 1000;
				Строка.КоличествоУпаковок = КоличествоУпаковок * Коэффициент;
				Модифицированность = Истина;
			КонецЕсли;
			Если Упаковка.Код = "003 " и ЕдиницаХранения.Код = "006 " тогда		//мм -> м
				Строка.Упаковка = ЕдиницаХранения;
				Коэффициент = 0.001;
				Строка.КоличествоУпаковок = КоличествоУпаковок * Коэффициент;
				Модифицированность = Истина;
			КонецЕсли;   
			Если Упаковка.Код = "006 " и ЕдиницаХранения.Код = "004 " тогда		//м -> см
				Строка.Упаковка = ЕдиницаХранения;
				Коэффициент = 100;
				Строка.КоличествоУпаковок = КоличествоУпаковок * Коэффициент;
				Модифицированность = Истина;
			КонецЕсли;
			Если Упаковка.Код = "004 " и ЕдиницаХранения.Код = "006 " тогда		//см -> м
				Строка.Упаковка = ЕдиницаХранения;
				Коэффициент = 0.01;
				Строка.КоличествоУпаковок = КоличествоУпаковок * Коэффициент;
				Модифицированность = Истина;
			КонецЕсли;
			Если Упаковка.Код = "050 " и ЕдиницаХранения.Код = "051 " тогда		//мм2 -> см2
				Строка.Упаковка = ЕдиницаХранения;
				Коэффициент = 0.01;
				Строка.КоличествоУпаковок = КоличествоУпаковок * Коэффициент;
				Модифицированность = Истина;
			КонецЕсли;
			Если Упаковка.Код = "051 " и ЕдиницаХранения.Код = "050 " тогда		//см2 -> мм2
				Строка.Упаковка = ЕдиницаХранения;
				Коэффициент = 100;
				Строка.КоличествоУпаковок = КоличествоУпаковок * Коэффициент;
				Модифицированность = Истина;
			КонецЕсли;    
			Если Упаковка.Код = "055 " и ЕдиницаХранения.Код = "051 " тогда		//м2 -> см2
				Строка.Упаковка = ЕдиницаХранения;
				Коэффициент = 10000;
				Строка.КоличествоУпаковок = КоличествоУпаковок * Коэффициент;
				Модифицированность = Истина;
			КонецЕсли;  
			Если Упаковка.Код = "051 " и ЕдиницаХранения.Код = "055 " тогда		//см2 -> м2
				Строка.Упаковка = ЕдиницаХранения;
				Коэффициент = 0.0001;
				Строка.КоличествоУпаковок = КоличествоУпаковок * Коэффициент;
				Модифицированность = Истина;
			КонецЕсли;
			Если Упаковка.Код = "112 " и ЕдиницаХранения.Код = "111 " тогда		//л(дм3) -> мл(см3)
				Строка.Упаковка = ЕдиницаХранения;
				Коэффициент = 1000;
				Строка.КоличествоУпаковок = КоличествоУпаковок * Коэффициент;
				Модифицированность = Истина;
			КонецЕсли;  
			Если Упаковка.Код = "111 " и ЕдиницаХранения.Код = "112 " тогда		//мл(см3) -> л(дм3)
				Строка.Упаковка = ЕдиницаХранения;
				Коэффициент = 0.001;
				Строка.КоличествоУпаковок = КоличествоУпаковок * Коэффициент;
				Модифицированность = Истина;
			КонецЕсли;
			Если Упаковка.Код = "112 " и ЕдиницаХранения.Код = "113 " тогда		//л(дм3) -> м3
				Строка.Упаковка = ЕдиницаХранения;
				Коэффициент = 0.001;
				Строка.КоличествоУпаковок = КоличествоУпаковок * Коэффициент;
				Модифицированность = Истина;
			КонецЕсли;
			Если Упаковка.Код = "113 " и ЕдиницаХранения.Код = "112 " тогда		//м3 -> л(дм3)
				Строка.Упаковка = ЕдиницаХранения;
				Коэффициент = 1000;
				Строка.КоличествоУпаковок = КоличествоУпаковок * Коэффициент;
				Модифицированность = Истина;
			КонецЕсли;  
		КонецЕсли;
	КонецЦикла;
	Если Модифицированность тогда
		//УстановитьПривилегированныйРежим(Истина);
		Спецификация.Записать();                         
		//УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСпецификацию(Команда)
	ПоследняяДата = ТекущаяДата();
	Посл = Объект.Спецификации.Количество()-1;
	Если НЕ РежимЧистки тогда
		Выполняется = "Исправление регистра Спецификации Изделий";
		Для Ном=0 по Посл цикл
			ОбновитьИндикатор(Ном/(Посл+1)*100, ПоследняяДата);
			ОбработатьСпецификациюНаСервере(Объект.Спецификации[Ном].Спецификация);
		КонецЦикла;
	Иначе
		Выполняется = "Исправление ошибочных спецификаций!";
		Для Ном=0 по Посл цикл
			ОбновитьИндикатор(Ном/(Посл+1)*100, ПоследняяДата);
			ОбработатьСпецификациюНаСервере1(Объект.Спецификации[Ном].Спецификация);
		КонецЦикла;
	КонецЕсли;
	Сообщить("Всё ОК");
КонецПроцедуры
